ahmedBase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-7.5 -1.4 0)
    (7.5 -1.4 0)
    (7.5  1.4 0)
    (-7.5  1.4 0)
    (-7.5 -1.4 1.87)
    (7.5 -1.4 1.87)
    (7.5  1.4 1.87)
    (-7.5  1.4 1.87)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (25 8 8) simpleGrading (1 1 1)
);

boundary
(
    front
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }
    back
    {
        type symmetryPlane;
        faces
        (
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type symmetryPlane;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
